src/DataProcessors/КонтактЦентр.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>КонтактЦентр</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

src/InformationRegisters/Пр_НастройкиУведомленийКалендарей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>Пр_НастройкиУведомленийКалендарей</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>УведомлениеОДлительномАнализе</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УведомлениеОДлительнойРазработке</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>МаксимальныйСрокАнализаДни</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>МаксимальныйСрокРазработкиДни</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПользовательУведомленийАнализ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПользовательУведомленийРазработка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТекстУведомленийАнализ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТекстУведомленийВРазработке</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>КалендарьСотрудника</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КалендариСотрудников</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/DataProcessors/КонтактЦентр/Forms/Пр_ФормаРедактированияТекстаУведомлений/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Не ЭтотОбъект.Параметры.Свойство("КалендарьСотрудника") Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	КалендарьСотрудника = ЭтотОбъект.Параметры.КалендарьСотрудника;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ТекстУведомленияПриИзменении(Элемент)
	Элементы.ТекстУведомления.АвтоОтметкаНезаполненного = ПустаяСтрока(СокрЛП(ЭтотОбъект.ТекстУведомления));
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Сохранить(Команда)
	
	Если ПустаяСтрока(СокрЛП(ЭтотОбъект.ТекстУведомления)) Тогда
		
		ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Перед сохранением необходимо заполнить текст уведомления!'"),,
													"ТекстУведомления", "ТекстУведомления");
		Возврат;
		
	КонецЕсли;
	
	Если ПустаяСтрока(СокрЛП(ЭтотОбъект.ТипУведомления)) Тогда
		
		ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Перед сохранением необходимо заполнить тип уведомления!'"),,
													"ТипУведомления", "ТипУведомления");
		Возврат;
		
	КонецЕсли;
	
	ЗаписатьДанныеОИзмененииТекстаУведомления(ЭтотОбъект.КалендарьСотрудника, ЭтотОбъект.ТекстУведомления, ЭтотОбъект.ТипУведомления);
	Закрыть();
	
КонецПроцедуры  

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Записывает значения характеристик в регистр
//
// Параметры:
// КалендарьСотрудника - СправочникСсылка.КалендариСотрудников
// ТекстУведомления - Строка
// ТипУведомления - Строка
//
&НаСервереБезКонтекста
Процедура ЗаписатьДанныеОИзмененииТекстаУведомления(Знач КалендарьСотрудника, Знач ТекстУведомления, Знач ТипУведомления)

	МенеджерИзменений = РегистрыСведений.Пр_НастройкиУведомленийКалендарей.СоздатьМенеджерЗаписи();
	МенеджерИзменений.КалендарьСотрудника = КалендарьСотрудника;
	МенеджерИзменений.Прочитать();  
	МенеджерИзменений.КалендарьСотрудника = КалендарьСотрудника;
	Если ТипУведомления = "Анализ" Тогда
		МенеджерИзменений.ТекстУведомленийАнализ = ТекстУведомления; 
	ИначеЕсли ТипУведомления = "ВРаботе" Тогда
		МенеджерИзменений.ТекстУведомленийВРазработке = ТекстУведомления;	
	КонецЕсли;
	МенеджерИзменений.Записать(Истина);  
	
КонецПроцедуры

#КонецОбласти
